Revit 2026 API

# UIControlledApplication Events

---

The UIControlledApplication type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApplicationClosing | Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed. |
|  | DialogBoxShowing | Subscribe to the DialogBoxShowing event to be notified when Revit is just about to show a dialog box or a message box. |
|  | DisplayingOptionsDialog | Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying. |
|  | DockableFrameFocusChanged | Subscribe to GenericDockableFrame activated event to be notified when Revit GenericDockableFrame is active or inactive. |
|  | DockableFrameVisibilityChanged | Subscribe to GenericDockableFrame showing or hiding event to be notified when Revit GenericDockableFrame is showing or hiding. |
|  | FabricationPartBrowserChanged | Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated. |
|  | FormulaEditing | Subscribe to the FormulaEditing event |
|  | Idling | Subscribe to the Idling event to be notified when Revit is not in an active tool or transaction. |
|  | SelectionChanged | Subscribe to the SelectionChanged event to be notified after the selection was changed. |
|  | ThemeChanged | Subscribe to the ThemeChanged event to be notified after the theme was changed. |
|  | TransferredProjectStandards | Subscribe to the TransferredProjectStandards event to be notified after the scope of a Transfer Project Standards operation has been finalized in the Transfer Project Standards dialog. |
|  | TransferringProjectStandards | Subscribe to the TransferringProjectStandards event to be notified before the scope of an impending Transfer Project Standards operation has been finalized. |
|  | ViewActivated | Subscribe to the ViewActivated event to be notified immediately after Revit has finished activating a view of a document. |
|  | ViewActivating | Subscribe to the ViewActivating event to be notified when Revit is just about to activate a view of a document. |

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace